tutorials/compressible/rhoPorousSimpleFoam/beaverJoseph/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    div(phi,U)      Gauss upwind;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
    div(phi,h)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,k)      Gauss upwind;
    div(phid,p)     Gauss linear;
}

laplacianSchemes
{
    laplacian(muEff,U) Gauss linear corrected;
    laplacian(alphaEff,h) Gauss linear corrected;
    laplacian((rho*rAU),p) Gauss linear corrected;
    laplacian(DepsilonEff,epsilon) Gauss linear corrected;
    laplacian(DkEff,k) Gauss linear corrected;
    laplacian(1,p)  Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    div(U,p)        upwind phi;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
